Repository: emotemot/PolkadotLightpaperTR
Catalog: Polkadot-Lightpaper.xliff
Languages: tr

source: Polkadot Lightpaper<x id="3"/>An Introduction to Polkadot
tr: Polkadot Lightpaper<x id="3"/>Polkadot'a Giriş

source: An Introduction to Polkadot
tr: Polkadot'a Giriş

source: “Polkadot empowers the individual against much more powerful corporate and state actors.”
tr: "Polkadot, bireyleri kurum ve devletler karşısında daha fazla güçlendirir."

source: Polkadot Founder
tr: Polkadot Kurucusu

source: Table of Contents
tr: İçindekiler

source: Introduction
tr: Giriş

source: Overview
tr: Genel Bakış

source: Heterogeneous Sharding
tr: Heterojen Sharding

source: Scalability
tr: Ölçeklenebilirlik

source: Upgradeability
tr: Geliştirebilirlik

source: Transparent Governance
tr: Şeffaf Yönetişim

source: Cross-Chain Composability
tr: Zincirler Arası Birleştirebilirlik

source: Polkadot Architecture
tr: Polkadot Mimarisi

source: Polkadot Consensus Roles
tr: Polkadot Mutabakat Rolleri

source: Polkadot Governance Roles
tr: Polkadot Yönetişim Rolleri

source: The DOT Token
tr: DOT Token

source: Kusama Network
tr: Kusama Ağı

source: About Web3 Foundation
tr: Web3 Foundation Hakkında

source: About Parity
tr: Parity Hakkında

source: Friends of Polkadot
tr: Polkadot'un İş Birlikleri

source: Contact
tr: İletişim

source: Introduction
tr: Giriş

source: LESS TRUST
tr: DAHA AZ GÜVEN

source: MORE TRUTH
tr: DAHA FAZLA DÜRÜSTLÜK

source: Every day we interact with technologies controlled by a handful of large companies whose interests and incentives often conflict with our own.
tr: Her gün, çıkarları ve teşvikleri genellikle bizimkilerle çatışan ve bir avuç büyük şirket tarafından kontrol edilen teknolojilerle etkileşime giriyoruz.

source: If we want the benefits of using their proprietary apps, we’re forced to agree to terms that most of us will never read, granting these companies complete control over the data we generate through each interaction with their tools.
tr: Onların uygulamalarını kullanmak ve avantajlarından yararlanmak için çoğumuz asla okumadığı şartları kabul etmek zorunda kalıyor. Böylece, bu şirketlerler her etkileşime geçtiğimizde veri üretiyor ve bu verilerin tam kontrol hakkını onlara veriyoruz.

source: Because that data can often paint a detailed picture of our personal lives, it’s become a resource more valuable than oil.
tr: Veriler, kişisel yaşantımızın detaylı bir resmini çizdikleri için petrolden daha değerli bir değer haline gelmiştir.

source: And we’re giving it up for free—with no choice but to trust that it won’t be lost, stolen or misused.
tr: Artık verilerimizi ücretsiz vermeye dur diyoruz. Çünkü verilerimizin kaybolmayacağına, çalınmayacağına veya kötüye kullanılmayacağına güvenmekten başka çaremiz yok.

source: At the same time, progress in open-source and decentralized technologies like blockchain has shown that we can build systems that prioritize individual sovereignty over centralized control.
tr: Aynı zamanda blokzincir gibi açık kaynaklı ve merkezi olmayan teknolojilerdeki ilerleme, bireysel egemenliği önceliklendiren ve merkezi kontrol yerine kullanmamızı sağlayan sistemler oluşturabileceğimizi göstermiştir.

source: With these new systems, there’s no need to trust any third parties not to be evil.
tr: Bu yeni sistemlerle birlikte, dürüst olmayan üçüncü şahıslara güvenmeye gerek kalmayacak.

source: But blockchain technology, in its current form, isn’t ready to break the corporate stranglehold on the web just yet.
tr: Ancak blokzincir teknolojisi bugünkü haliyle, web'deki kurumsal baskıyı kırmaya henüz hazır değil.

source: Despite the promise and the progress made, we have yet to see significant real-world deployment of the technology.
tr: Verilen vaatlere ve ilerlemeye rağmen, teknolojinin gerçek dünyada önemli bir şekilde kullanım alanını henüz göremedik.

source: Overview
tr: Genel Bakış

source: Polkadot is a next-generation blockchain protocol that unites an entire network of purpose-built blockchains, allowing them to operate seamlessly together at scale.
tr: Polkadot, amaca yönelik oluşturulmuş blokzincirlerden oluşan bir ağın tamamını bir araya getiren, birlikte sorunsuz ve ölçeklenebilir bir şekilde çalışmalarını sağlayan yeni nesil bir blokzincir protokolüdür.

source: Because Polkadot allows any type of data to be sent between any type of blockchain, it unlocks a wide range of real-world use cases.
tr: Polkadot, her türden verinin her türden blokzincir arasında iletişimini mümkün kıldığı için, çeşitli kullanım senaryolarını gerçekleştirmek için fırsat sunar.

source: By bringing together the best features from multiple specialized blockchains, Polkadot paves the way for new decentralized marketplaces to emerge, offering fairer ways to access services through a variety of apps and providers.
tr: Polkadot, birden fazla özel blokzincirin en iyi özelliklerini bir araya getirerek, yeni merkezi olmayan pazarların ortaya çıkmasının önünü açar ve çeşitli uygulamalar ve sağlayıcılar aracılığıyla hizmetlerin erişimini daha adil bir şekilde sunar.

source: While blockchains have demonstrated great promise in several fields—Internet of Things (IoT), finance, governance, identity management, web decentralization, and asset-tracking to name a few—design limitations in previous systems have largely hindered large-scale adoption.
tr: Blokzincirleri, nesnelerin interneti (IoT), finans, yönetişim, kimlik yönetimi, merkeziyetsiz web ve dijital varlık izleme gibi çeşitli alanlarda büyük umut vaat ederken, önceki sistemlerde kitlesel benimsemeyi engelleyen tasarım sınırlamalarını büyük ölçüde aştı.

source: <g id="1">Polkadot’s design offers several distinct advantages over existing and legacy networks, including <g id="2">heterogeneous sharding, scalability,</g> <g id="3">upgradeability, transparent governance and cross-chain composability.</g></g>
tr: <g id="1">Polkadot’un tasarımı, mevcut ve daha eski blokzincir ağlarına göre farklı avantajlar sunar: <g id="2">heterojen sharding, ölçeklenebilirlik,</g> <g id="3">geliştirilebilirlik, şeffaf yönetişim ve zincirler arası bitleştirebilirlik.</g></g>

source: THIS IS
tr: SINIRSIZ

source: BLOCKCHAIN UNBOUNDED
tr: BLOKZİNCİR

source: Heterogeneous Sharding
tr: Heterojen Sharding

source: Many chains,
tr: Birçok zincir,

source: one network
tr: tek ağ

source: Will there eventually be one blockchain to rule them all?
tr: Sonunda tüm zincirlere hükmedecek bir blokzincir olacak mı?

source: We don’t think so.
tr: Hayır, böyle bir şeyin gerçekleşeceğini düşünmüyoruz.

source: All blockchains make different tradeoffs to support specific features and use cases, and as chain specialization increases, the need to transact between them will only increase over time.
tr: Blokzincirler, destekledikleri kullanım senaryolarına göre güvenlik, hız ve sürdürülebilirlik gibi bazı özellikler arasında tercih yapmak durumunda kalırlar. Zincir uzmanlığı arttıkça, bu zincirler arasında işlem yapma ihtiyacı zamanla artış gösterecektir.

source: Polkadot is a sharded blockchain, meaning it connects several chains together in a single network, allowing them to process transactions in parallel and exchange data between chains with security guarantees.
tr: Polkadot, parçalanmış bir blokzincirdir, yani birkaç zinciri tek bir ağda birbirine bağlayarak, işlemleri paralel olarak işlemelerine ve güvenlik garantili zincirler arasında veri alışverişinde bulunmalarına olanak tanır.

source: Thanks to Polkadot’s unique heterogeneous sharding model, each chain in the network can be optimized for a specific use case rather than being forced to adapt to a one-size-fits-all model.
tr: Polkadot’un benzersiz heterojen sharding modeli sayesinde, ağdaki her bir zincir, herkese uyan tek bir modele uyarlanmak yerine belirli bir kullanım senaryosu için optimize edilebilir.

source: More chains and more specialization means more possibilities for innovation.
tr: Daha fazla zincir ve uzmanlık alanı, daha fazla yenilik fırsatı anlamına gelir.

source: Scalability
tr: Ölçeklenebilirlik

source: Blockchains
tr: Büyüyen

source: that grow
tr: blokzincirler

source: One blockchain isn’t enough to support a bustling future of decentralized applications.
tr: Merkezi olmayan dağıtık uygulamaların geleceğini desteklemek için tek bir blokzincir yeterli değildir.

source: The limited throughput and lack of runtime specialization in early blockchains made them impractical for scaling in many real-world use cases.
tr: İlk blokzincirlerindeki sınırlı kapasite ve runtime konularındaki uzmanlık eksikliği, birçok gerçek dünya kullanım senaryosunun ölçeklenebilir hale gelememesine sebep oldu.

source: By bridging multiple specialized chains together into one sharded network, Polkadot allows for multiple transactions to be
tr: Polkadot, birden fazla özel amaçlarla oluşturulmuş zincirleri tek bir parçalanmış ağda birleştirerek birden fazla işlemin

source: processed in parallel.
tr: paralel olarak işlenmesini sağlıyor.

source: This system removes the bottlenecks that occurred on earlier networks that processed transactions one-by-one.
tr: Bu sistem, önceki ağlarda işlemlerin tek tek işlemesi sebebiyle meydana gelen darboğazları ortadan kaldırır.

source: <g id="1">Polkadot will be able to scale even further in the future with a planned feature known as <g id="2">nested relay chains</g>, which will increase the<g id="3"> </g>number of shards that can be added to the network.</g>
tr: <g id="1">Polkadot, <g id="2">nested (iç içe) relay chains</g> adıyla bilinen planlı özelliği sayesinde gelecekte daha da ölçeklenebilir durumda olacak. Nested relay chains, <g id="3"> </g>ağa eklenebilecek parça sayısı artıracak.</g>

source: Upgradeability
tr: Geliştirilebilirlik

source: Future-proof your blockchain with forkless upgrades
tr: Zahmetsiz çatallama ile blokzinciriniz geleceğe daima hazır

source: Early computer games were shipped on printed circuit boards known as cartridges.
tr: İlk bilgisayar oyunları, kartuş olarak bilinen baskılı devre kartlarında satılıyordu.

source: These cartridges were expensive and time-consuming to make as the code was etched onto the chips, leaving no room for error.
tr: Bu kartuşlar içerisindeki oyunun kodu çiplere tek seferde kazındığından, herhangi bir hata kabul etmeyen bu süreç, zaman istiyordu ve oldukça pahalıydı.

source: These days we’re used to our apps, games and browsers updating frequently, even automatically.
tr: Bugünlerde uygulamalarımızın, oyunlarımızın ve tarayıcılarımızın sık sık, hatta otomatik olarak güncellenmesine alışkınız.

source: Developers fix bugs before they can cause problems, and new features are added as better solutions become available.
tr: Geliştiriciler, sorun yaratmadan önce hataları düzeltiyor ve daha iyi çözümler ortaya çıktıkça yeni özellikler ekleyebiliyorlar.

source: Like all software, blockchains need upgrades in order to stay relevant.
tr: Tüm yazılımlar gibi, blokzincirlerin de sürdürülebilir olması için güncellemelere ihtiyacı vardır.

source: However, it’s far more difficult to upgrade a blockchain than an app, game, or browser.
tr: Ancak bir blokzinciri güncellemek bir uygulama, oyun veya tarayıcıdan çok daha zordur.

source: Upgrading conventional blockchains requires forking the
tr: Geleneksel blokzincirleri güncellemek,

source: network, often taking months of work, and particularly contentious hard forks can break apart a community.
tr: genellikle ağ üzerinde aylar süren çalışma gerektirir. Özelliklerde mutabık kalınmaması durumunda yeni çatallanmalar (hardfork) ortaya çıkabilir ve bir topluluğu parçalayabilir.

source: Polkadot revolutionizes this process, enabling blockchains to upgrade themselves without the need to fork the chain.
tr: Polkadot, bu süreçte devrim yaratarak blokzincirlerin, zinciri çatallamaya gerek kalmadan kendilerini güncellemelerine olanak tanır.

source: These forkless upgrades are enacted through Polkadot’s transparent on-chain governance system.
tr: Bu çatallanma gerektirmeyen güncellemeler, Polkadot’un şeffaf ve zincir üstü yönetişim sistemi aracılığıyla hayata geçirilir.

source: With this feature, Polkadot enables projects to stay agile, adapting and evolving with the pace of technology.
tr: Polkadot bu özelliği ile projelerin çevik kalmasını, teknolojinin hızına uyum sağlamasını ve gelişmesini sağlar.

source: It also significantly reduces the risk associated with contentious hard forks—a severe barrier to entry for many organizations.
tr: Ayrıca, pek çok kuruluş için ciddi bir engel olan çatallanmayla ilişkili riskleri önemli ölçüde azaltır.

source: Transparent Governance
tr: Şeffaf Yönetişim

source: Community
tr: Gücünü

source: powered
tr: topluluktan alır

source: Early blockchains had no formal governance procedures.
tr: İlk blokzincirlerin resmi yönetişim prosedürleri yoktu.

source: Individual stakeholders were powerless to propose or veto protocol changes unless they knew the right people.
tr: Bireysel paydaşlar, doğru kişileri tanımadıkları sürece protokol değişikliklerini önerme veya veto etme konusunda güçsüz sayılırdı.

source: Polkadot is different.
tr: Ancak Polkadot farklı.

source: It’s governed by anyone who owns DOTs, Polkadot’s native currency, in a fair and transparent way.
tr: Polkadot, kendi para birimi olan DOT’lara sahip olan herkes tarafından adil ve şeffaf bir şekilde yönetilir.

source: All DOT holders are able to propose a change to the protocol or vote on existing proposals.
tr: Tüm DOT sahipleri, protokol için değişiklik önerebilir veya mevcut önerileri oylayabilir.

source: They can also help elect council members who represent passive stakeholders within Polkadot’s governance system.
tr: Ayrıca, Polkadot’un yönetişim sistemi içindeki pasif paydaşları temsil eden konsey üyelerinin de seçilmesine yardımcı olabilirler.

source: Cross-Chain Composability
tr: Zincirler Arası Birleştirebilirlik

source: Collaborative
tr: İşbirlikçi

source: by design
tr: tasarım

source: Early blockchains were like walled gardens closed off to other networks.
tr: İlk blokzincirler, diğer ağlara arasında duvarları olan bahçeler gibiydi.

source: But as the number of chains for specific use cases continues to rise, so does the need for cross-chain communication and interoperability.
tr: Ancak belirli kullanım senaryoları için zincir sayısı artmaya devam ettikçe, zincirler arası iletişim ve birlikte çalışabilirlik ihtiyacı da artmayı sürdürdü.

source: Polkadot’s cross-chain composability and message passing allows shards to communicate, exchange value, and share functionality, opening the door to a new wave of innovation.
tr: Polkadot’un zincirler arası birleştirilebilirliği, parçaların iletişim kurmasına, mesaj iletimine, değer alışverişinde bulunmasına ve işlevselliği paylaşmasına olanak tanıyarak, yeni bir inovasyon fırsatı hareketini başlattı.

source: Thanks to Polkadot’s ability to bridge blockchains, Polkadot shards will also be able to interact with popular decentralized-finance protocols and cryptoassets on external networks like Ethereum.
tr: Polkadot’un blokzincirlerini köprüleme yeteneği sayesinde, Polkadot parçaları, Ethereum gibi harici ağlardaki popüler merkezi olmayan finans protokolleri ve kripto varlıklar ile de etkileşime girebilecek.

source: Polkadot Architecture
tr: Polkadot Mimarisi

source: Connecting
tr: Noktaları

source: the dots
tr: birleştirin

source: Polkadot unites a network of
tr: Polkadot, parachain adı verilen

source: heterogeneous blockchain shards
tr: heterojen blokzincir parçalarını

source: called parachains.
tr: birleştirir.

source: These chains
tr: Bu zincirler

source: connect to and are secured by
tr: birbirlerine Polkadot Relay Chain

source: the Polkadot Relay Chain.
tr: üzerinden güvenli bir şekilde bağlanırlar.

source: They
tr: Ek olarak,

source: can also connect with external
tr: harici blokzincir protokolleriyle de

source: networks via bridges.
tr: köprüleme özelliğiyle bağlantı kurabilirler.

source: The heart of Polkadot, responsible for the network’s security, consensus and cross-chain interoperability.
tr: Polkadot'un kalbi olarak adlandırabileceğimiz Relay Chain, ağın güvenliğinden, mutabakatından ve zincirler arası birlikte çalışabilirliğinden sorumludur.

source: Parachains
tr: Parachainler

source: Sovereign blockchains that can have their own tokens and optimize their functionality for specific use cases.
tr: Kendi tokenlerine sahip olabilen ve belirli kullanım senaryoları için işlevselliğini optimize edebilen bağımsız blokzincirler.

source: To connect to the Relay Chain, parachains can pay as they go or lease a slot for continuous connectivity.
tr: Parachain'ler, Relay Chain'e iki şekilde bağlanabilir. Bunlardan biri kullandıkça öde yöntemidir. Diğeri ise sürekli bağlantı için bir slot kiralama yöntemidir.

source: Bridges
tr: Köprüler

source: Special blockchains that allow Polkadot shards to connect to and communicate with external networks like Ethereum and Bitcoin.
tr: Polkadot parçalarının Ethereum ve Bitcoin gibi harici ağlara bağlanmasına ve iletişim kurmasına izin veren özel blokzincirlerdir.

source: Polkadot Consensus Roles
tr: Polkadot Mutabakat Rolleri

source: Validators
tr: Validatörler

source: Secure the Relay Chain by staking DOTs, validating proofs from collators and participating in consensus with other validators.
tr: DOT'ları stake ederek, düzenleyicilerden gelen kanıtları doğrular ve diğer validatörlerle mutabakata katılarak Relay Chain'i güvence altına alırlar.

source: Collators
tr: Düzenleyiciler

source: Maintain shards by collecting shard transactions from users and producing proofs for validators.
tr: Kullanıcılardan gelen parça işlemleri toplayarak ve validatörler için kanıtlar üreterek parçaları korurlar.

source: Nominators
tr: Atayıcılar

source: Secure the Relay Chain by selecting trustworthy validators and staking DOTs.
tr: Güvenilir validatörleri seçerek ve DOT'ları stake ederek Relay Chain'i güvence altına alırlar.

source: Fishermen
tr: Balıkçılar

source: Monitor the network and report bad behavior to validators.
tr: Ağı izleyerek ve kötü davranışları validatörlere bildirirler.

source: Collators and any parachain full node can perform the fisherman role.
tr: Düzenleyiciler veya herhangi bir parachain'in tam düğümü, balıkçı rolünü yerine getirebilir.

source: Polkadot Governance Roles
tr: Polkadot Yönetişim Rolleri

source: Council Members
tr: Konsey Üyeleri

source: Elected to represent passive stakeholders in two primary governance roles: proposing referenda and vetoing dangerous or malicious referenda.
tr: Referandum önermek ve zararlı veya kötü niyetli referandumları veto etmek gibi, pasif paydaşları iki temel yönetişim rolünde temsil etmek amacıyla seçilirler.

source: Technical Committee
tr: Teknik Komite

source: Composed of teams actively building
tr: Polkadot'ta aktif olarak geliştirme yapan ekiplerden oluşur

source: Can propose emergency
tr: Konsey ile birlikte acil durum

source: referenda, together with the council,
tr: referandumu önerebilir, oylama işlemi

source: for fast-tracked voting and implementation.
tr: hızlı bir şekilde gerçekleştirilir ve yürürlüğe koyulur.

source: DOTs
tr: DOT'lar

source: The DOT Token
tr: DOT Token

source: The DOT token serves three
tr: DOT tokenın üç

source: distinct purposes: governance
tr: farklı amacı vardır:

source: over the network, operation and
tr: ağ yönetişimi, operasyon

source: bonding.
tr: ve birleştirme.

source: Governance
tr: Yönetişim

source: Polkadot token holders have complete control over the protocol.
tr: Polkadot token sahipleri protokol üzerinde tam kontrole sahiptir.

source: All privileges, which on other platforms are exclusive to miners, will be given to the Relay Chain participants (DOT holders), including managing exceptional events such as protocol upgrades and fixes.
tr: Diğer platformlarda protokol yükseltmeleri ve düzeltmeler gibi istisnai olayların yönetilmesi gibi madencilere özel olan tüm ayrıcalıklar, Relay Chain katılımcılarına (DOT sahiplerine) verilecektir.

source: Operation
tr: Operasyon

source: Game theory incentivizes token holders to behave in honest ways.
tr: Oyun teorisi, token sahiplerini dürüst bir şekilde davranmaya teşvik eder.

source: Good actors are rewarded by this mechanism whilst bad actors will lose their stake in the network.
tr: İyi oyuncular bu mekanizma tarafından ödüllendirilirken, kötü oyuncular ağdaki paylarını kaybedeceklerdir.

source: This ensures the network stays secure.
tr: Böylece, ağın güvenli kalması sağlanır.

source: Bonding
tr: Bağlama

source: New parachains are added by bonding tokens.
tr: Yeni parachainler, bağlama tokenları ile eklenirler.

source: Outdated or non-useful parachains are removed by removing bonded tokens.
tr: Eski veya kullanışsız parachainler, bağlama tokenları kaldırılarak kaldırılır.

source: This is a form of proof of stake.
tr: Bu, hisse kanıtının (proof of stake) bir türüdür.

source: Play with chaos on Kusama, Polkadot’s wild cousin
tr: Polkadot’un vahşi kuzeni Kusama’da kaosla oynayın

source: Kusama is an early, unaudited and unrefined release of Polkadot created to test the network’s technology and economic incentives in a real-world environment.
tr: Kusama, ağın teknolojisini ve ekonomik teşviklerini gerçek dünya ortamında test etmek için oluşturulmuş Polkadot'un erken, denetlenmemiş ve rafine edilmemiş bir sürümüdür.

source: It’s also the perfect place for parachain developers to test ideas before deploying to Polkadot.
tr: Ayrıca, parachain geliştiricilerinin zincirlerini Polkadot'a aktarmadan önce fikirleri test etmeleri için mükemmel bir yerdir.

source: Kusama is owned and governed by a community of supporters who hold KSM tokens.
tr: Kusama, KSM token'larına sahip topluluğa aittir ve bu topluluk tarafından yönetilmektedir.

source: There is no central kill switch, meaning it will live on as an independent community network.
tr: Merkezi bir kill switch (kapatma düğmesi) yoktur, yani bağımsız bir topluluk ağı olarak yaşayacaktır.

source: Ready to break stuff?
tr: Bir şeyleri kırmaya hazır mısın?

source: Find out how to get KSM tokens and start staking, validating and participating in governance by reading the user guide.
tr: Kullanıcı kılavuzunu okuyarak KSM tokenlarını nasıl edineceğinizi ve stake edebileceğinizi, doğrulama süreçleri ve yönetişime katılmaya nasıl başlayacağınızı öğrenin.

source: Your blockchain builder, Your blockchain upgrader,
tr: Sizin blokzinciriniz, Sizin blokzincir oluşturucunuz,

source: Your blockchain.
tr: Sizin blokzincir geliştiriciniz.

source: Substrate is your blockchain-building framework, making it easy to create a custom blockchain optimized for your unique use case.
tr: Substrate, benzersiz kullanım senaryonuz için optimize edilmiş özel bir blokzincir oluşturmayı kolaylaştıran bir frameworktür.

source: Substrate is fully modular and flexible: mix and match ready-made components and build out your core business logic while leaving the rest to the framework.
tr: Alt yapısı tamamen modüler ve esnek olan Substrate'in hazır bileşenlerini karıştırın ve eşleştirin ve geri kalanını frameworke bırakırken temel iş mantığınızı oluşturun.

source: Plug-and-play modules like consensus, networking and finality give you the freedom to focus on your specific area of expertise, saving you substantial time and effort in the development process.
tr: Mutabakat, ağ oluşturma ve kesinlik gibi tak ve çalıştır modülleri, size özel uzmanlık alanınıza odaklanma özgürlüğü vererek geliştirme sürecinde önemli ölçüde zaman ve çaba tasarrufu sağlar.

source: Keep things lean by implementing only the necessary functionality on your custom blockchain.
tr: Özel blokzincirinizde yalnızca gerekli işlevselliği koruyarak işlerinizi yalın tutun.
