Repository: emotemot/PolkadotLightpaperTR
Catalog: Polkadot-Lightpaper.xliff
Languages: tr

source: Thanks to Substrate’s forkless upgrades and transparent governance tools, you can add new features over time without fear of splitting the network.
tr: Substrate’in çatallanma gerektirmeyen güncellemeleri ve şeffaf yönetim araçları sayesinde, zaman içinde ağı bölme korkusu olmadan yeni özellikler ekleyebilirsiniz.

source: Easier, risk-free upgrading means your blockchain can grow and evolve with the pace of innovation and ever-changing market needs.
tr: Daha kolay, risksiz güncelleme, blokzincirinizin inovasyon hızı ve sürekli değişen pazar ihtiyaçları ile büyüyüp gelişebileceği anlamına gelir.

source: Substrate also comes with native support for connecting to Polkadot right out of the box.
tr: Ayrıca Substrate, Polkadot'a bağlanmak için yerel destekle birlikte gelir.

source: Cumulus, Substrate’s tool for connecting your blockchain to a network of blockchains, unlocks interchain communication, collaboration and shared security.
tr: Substrate'in blokzincirinizi bir blokzincir ağına bağlamanız için gerekli bir araç olan Cumulus, zincirler arası iletişimin, işbirliğinin ve paylaşımlı güvenliğin kilidini açar.

source: Learn more about Substrate here and at the Substrate Developer Hub.
tr: Substrate hakkında daha fazla bilgiyi burada ve Substrate Developer Hub'da bulabilirsiniz.

source: About Web3 Foundation
tr: Web3 Foundation Hakkında

source: Web3 Foundation was created to nurture and steward technologies and applications in the fields of decentralized web software protocols, particularly those that utilize modern cryptographic methods to safeguard decentralization, to the benefit
tr: Web3 Foundation, Web3 ekosistemi olarak tanımlanan merkezi olmayan web yazılım protokolleri alanındaki teknolojilere, uygulamalara, özellikle de ademi merkeziyetçiliği korumak için modern kriptografik yöntemleri kullananlara

source: and for the stability of the Web3 ecosystem.
tr: fayda sağlamak, desteklemek ve yönetmek için kuruldu.

source: Polkadot is the flagship protocol of Web3 Foundation.
tr: Polkadot, Web3 Foundation'ın amiral gemisi protokolüdür.

source: The future of the foundation
tr: Vakfın geleceği

source: Web3 Foundation seeks to fund or otherwise assist in the development and deployment of projects aligned with its mission:
tr: Web3 Foundation, misyonuyla uyumlu projelerin geliştirilmesi ve yayınlanması için fon sağlama veya başka şekillerde yardımcı olmayı amaçlamaktadır:

source: Innovative blockchain technologies, cryptographic messaging protocols.
tr: Yenilikçi blokzincir teknolojileri, kriptografik mesajlaşma protokolleri.

source: Peer-to-peer networking infrastructure (such as libp2p and devp2p)
tr: Eşler arası ağ altyapısı (libp2p ve devp2p gibi)

source: Crypto-economic mechanisms (such as DAC/DAOsoftware)
tr: Kripto-ekonomik mekanizmalar (DAC / DAO'lar gibi)

source: Data publication systems
tr: Veri iletimi ve dağıtımı sistemleri

source: (such as IPFS).
tr: (IPFS gibi).

source: <g id="1">Learn more at<g id="2"> </g><g id="3">web3.foundation</g> and on<g id="4"> </g><g id="5">Twitter</g><g id="6"> </g>and<g id="7"> </g><g id="8">YouTube</g>.</g>
tr: <g id="1">Daha fazla bilgi edinmek için<g id="2"> </g><g id="3">web3.foundation</g>,<g id="4"> </g><g id="5">Twitter</g><g id="6"> </g>ve<g id="7"> </g><g id="8">YouTube'u</g>ziyaret edebilirsiniz.</g>

source: development
tr: Geliştirici

source: team
tr: Ekip

source: About Parity
tr: Parity Hakkında

source: Web3 Foundation has commissioned Parity Technologies to build Polkadot.
tr: Web3 Foundation, Polkadot'u geliştirmek için Parity Technologies'i görevlendirdi.

source: Founded by Ethereum cofounder
tr: Ethereum kurucu ortağı tarafından kuruldu

source: Dr. Gavin Wood, Parity is a global team of top distributed systems engineers, cryptographers, solutions architects and researchers.
tr: Dr. Gavin Wood, Parity, en iyi dağıtık sistem mühendisleri, kriptograflar, çözüm mimarları ve araştırmacılardan oluşan küresel bir ekiptir.

source: Parity has fundamentally shaped the blockchain industry, from building the highly-adopted Parity Ethereum client and implementations of Bitcoin and Zcash, to developing the next generation of blockchain technology with Substrate and Polkadot.
tr: Parity, son derece benimsenen Parity Ethereum istemcisi, Bitcoin ve Zcash uygulamalarından sonra Substrate ve Polkadot gibi yeni nesil blokzincir teknolojilerini geliştirmiş ve blokzincir endüstrisini temelden şekillendiren işlere imza atmıştır.

source: <g id="1">Learn more about Parity Technologies at<g id="2"> </g><g id="3">parity.io</g><g id="4"> </g>and follow the team on<g id="5"> </g><g id="6">Twitter</g>,<g id="7"> </g><g id="8">Telegram</g>,<g id="9"> </g><g id="10">YouTube</g>, and<g id="11"> </g><g id="12">Riot</g>.</g>
tr: <g id="1">Parity Technologies hakkında daha fazla bilgi edinmek için<g id="2"> </g><g id="3">parity.io adresini ziyaret edebilir</g><g id="4"> </g>ve ekibi<g id="5"> </g><g id="6">Twitter</g>,<g id="7"> </g><g id="8">Telegram</g>,<g id="9"> </g><g id="10">YouTube</g>, ve<g id="11"> </g><g id="12">Riot</g> üzerinden takip edebilirsiniz.</g>

source: Friends of
tr: Polkadot

source: Polkadot
tr: & Substrate

source: & Substrate
tr: İş Birlikleri

source: Collaborations
tr: İş Birlikleri

source: Polkadot is designed to work with public, private and enterprise chains.
tr: Polkadot, kamu, özel ve kurumsal zincirlerle çalışmak üzere tasarlanmıştır.

source: We are excited to work closely with the following partners to develop the first use cases, and look forward to collaborating with other blockchain projects seeking to adopt this technology:
tr: İlk yaygın kullanım senaryolarını geliştirmek için aşağıdaki ortaklarla yakın bir şekilde çalışmaktan heyecan duyuyoruz ve bu teknolojiyi benimsemek isteyen diğer blokzincir projeleriyle iş birliği yapmayı dört gözle bekliyoruz:

source: Dive deeper, stay connected and get building!
tr: Daha derine dalın, bağlantıda kalın ve geleceği inşa etmeye başlayın!

source: Learn more on the
tr: Daha fazla bilgi edinmek için

source: <g id="1">→ </g><g id="2">Join</g><g id="3"> </g><g id="4">or<g id="5"> </g><g id="6">→ </g><g id="7">host</g></g>
tr: <g id="1">→ </g><g id="2">Katılın</g><g id="3"> </g><g id="4">veya<g id="5"> </g><g id="6">→ </g><g id="7">organize edin</g></g>

source: <g id="1">Polkadot<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">Website</g></g>
tr: <g id="1">Polkadot<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">Websitesi</g></g>

source: a Polkadot meetup
tr: bir Polkadot etkinliği

source: <g id="1">and<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">Wiki</g></g>
tr: <g id="1">ve<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">Wiki</g></g>

source: in your area
tr: bölgenizde

source: Subscribe to the Polkadot
tr: Polkadot'a abone olun

source: Chat with the Polkadot team
tr: Polkadot ekibiyle sohbet edin

source: <g id="1">→ </g><g id="2">Newsletter</g>
tr: <g id="1">→ </g><g id="2">bültenine</g>

source: <g id="1">on<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">Riot</g></g>
tr: <g id="1">ile<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">Riot</g></g>

source: <g id="1">Get involved by<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">joining</g><g id="6"> </g>the</g>
tr: <g id="1">Etkileşime geçin<g id="2"> </g><g id="3">→</g><g id="4"> </g><g id="5">katılarak</g><g id="6"> </g></g>

source: Additional resources
tr: Ek kaynaklar

source: <g id="1">→ </g><g id="2">Polkadot Ambassador</g>
tr: <g id="1">→ </g><g id="2">Polkadot Temsilcilik</g>

source: can be found
tr: bulabilirsiniz

source: Program
tr: Programına

source: <g id="1">→<g id="2"> </g><g id="3">here</g></g>
tr: <g id="1">→<g id="2"> </g><g id="3">buradan</g></g>

source: Follow Polkadot on:
tr: Polkadot'u takip edin:
